README.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Graduate advisor - Group 1</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Graduate advisor - Group 1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-05-08T22:27-0500"/>
<meta name="author" content="Tjaart van der Walt"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Graduate advisor - Group 1</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Deployed location</a></li>
<li><a href="#sec-2">2 Our approach</a></li>
<li><a href="#sec-3">3 Getting help</a>
<ul>
<li><a href="#sec-3-1">3.1 If its slow its working</a></li>
<li><a href="#sec-3-2">3.2 Check your configuration</a></li>
<li><a href="#sec-3-3">3.3 Built in help</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Browser compatibility</a>
<ul>
<li><a href="#sec-4-1">4.1 Why our application is not compatible with Internet Explorer</a></li>
<li><a href="#sec-4-2">4.2 Tested browsers</a></li>
</ul>
</li>
<li><a href="#sec-5">5 Technical details</a></li>
<li><a href="#sec-6">6 Known bugs</a></li>
<li><a href="#sec-7">7 Incomplete features</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Deployed location</h2>
<div class="outline-text-2" id="text-1">

<p>  The application can be found at:
  <a href="http://comp.umsl.edu/~Group1/graduate-advisor/">http://comp.umsl.edu/~Group1/graduate-advisor/</a>
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Our approach</h2>
<div class="outline-text-2" id="text-2">

<p>  Our approach is to map out the schedule for your entire degree using the available data.
  You simply have to input
</p><ul>
<li>some configuration details
</li>
<li>courses you have waivers for
</li>
<li>courses you have completed
</li>
<li>courses you would like to take

<p>  
  You do not need to specify all courses you want to take, the system will fill any unselected courses so that the degree requirements will be fulfilled.
</p></li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Getting help</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> If its slow its working</h3>
<div class="outline-text-3" id="text-3-1">

<p>The backend normally returns almost instantaneously, for difficult cases however it can take some time to complete. On our test systems it normally returned within a minute. If it cannot find a valid schedule it will display an error message to that effect.
</p></div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Check your configuration</h3>
<div class="outline-text-3" id="text-3-2">

<p>During our testing, we often found found our configuration to be the thing that tripped us up. If you can't get a solution try relaxing some restrictions.
</p>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Built in help</h3>
<div class="outline-text-3" id="text-3-3">

<p>  If you don't understand the user interface we have a context sensitive help page that explain the usage for the currently selected tab. Simply click on the button marked with a ? in the top  corner.
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Browser compatibility</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Why our application is not compatible with Internet Explorer</h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li>The default browser in the computer lab is Firefox.
</li>
<li>We wanted to use some advanced HTML5 functionality.
</li>
<li>We had limited resources and time.
</li>
<li>Internet Explorer has become irrelevant.
</li>
</ul>


</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Tested browsers</h3>
<div class="outline-text-3" id="text-4-2">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Browser</th><th scope="col" class="left">Versions</th><th scope="col" class="left">Status</th></tr>
</thead>
<tbody>
<tr><td class="left">Firefox</td><td class="left">27, 29</td><td class="left">fully tested and supported</td></tr>
<tr><td class="left">Chrome</td><td class="left">34</td><td class="left">supported (not comprehesively tested)</td></tr>
<tr><td class="left">Internet Explorer</td><td class="left">all</td><td class="left">UNSUPPORTED</td></tr>
</tbody>
</table>


</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Technical details</h2>
<div class="outline-text-2" id="text-5">

<p>  We have implemented <b>almost</b> everything in Javascript.
  The only exception is that the XML data files are parsed with a 5-line php script and embedded as JSON directly into the html page. The advantage of this approach  is that we can provide a cached version of the XML data should the original XML page be down for any reason. If we rewrote  this code in javascript we would have a completely client side solution, requiring only that the XML data files be available in some predefined location.
</p>
<p>  
We use the following Javascript frameworks
</p><ul>
<li>JQuery
</li>
<li>Bootstrap
</li>
<li>Trip.js
</li>
</ul>


<p>  
Our backend implements a depth first search algorithm with backtracking.
</p>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Known bugs</h2>
<div class="outline-text-2" id="text-6">

<ul>
<li>If you Select a 6000 level course and you add other courses after that the "bucket fill lines" grow thicker.
</li>
<li>If you select a 6000 without its prerequisite, run the scheduler, and go back to the selected tab the 6000 level course will be be highlighted as if it was scheduled with a prerequisite.
</li>
<li>After loading data from the JSON file, not all configuration options are correctly displayed.
</li>
</ul>


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Incomplete features</h2>
<div class="outline-text-2" id="text-7">

<ul>
<li>Edit your schedule after it has been created by the application, and then recreate with the new criteria. Possible options will be to: Anchor a course in its current position, move a course to another semester, or remove a course from the schedule.
</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-05-08T22:27-0500</p>
<p class="author">Author: Tjaart van der Walt</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
